# Ultralytics YOLOv8s-CBAM object detection model
# 改进: 骨干网络和颈部网络中的 C2f 模块替换为 C2f_CBAM
# C2f_CBAM = C2f + CBAM(通道注意力 + 空间注意力)

# Parameters
nc: 3  # number of classes (RBC, WBC, Platelet)
scales:
  s: [0.33, 0.50, 1024]  # YOLOv8s scale

# Backbone with CBAM attention
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f_CBAM, [128, True]]  # 2 (CBAM after C2f)
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f_CBAM, [256, True]]  # 4 (CBAM after C2f)
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 6, C2f_CBAM, [512, True]]  # 6 (CBAM after C2f)
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 3, C2f_CBAM, [1024, True]] # 8 (CBAM after C2f)
  - [-1, 1, SPPF, [1024, 5]]        # 9

# Head with CBAM attention
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]          # cat backbone P4
  - [-1, 3, C2f_CBAM, [512]]           # 12 (CBAM after C2f)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]          # cat backbone P3
  - [-1, 3, C2f_CBAM, [256]]           # 15 (P3/8-small, CBAM)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]         # cat head P4
  - [-1, 3, C2f_CBAM, [512]]           # 18 (P4/16-medium, CBAM)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]          # cat head P5
  - [-1, 3, C2f_CBAM, [1024]]          # 21 (P5/32-large, CBAM)

  - [[15, 18, 21], 1, Detect, [nc]]    # Detect(P3, P4, P5)
